#+title: emacs configuration
#+property: header-args:emacs-lisp :tangle /users/eddie/.emacs.d/init.el :mkdirp yes
#+options: num:nil
#+html_head <link rel="stylesheet" type"text/css" href=""/>

** Org custom 설정

#+begin_src emacs-lisp
    (use-package org
      :hook (org-mode . efs/org-mode-setup) ;훅을 쓰는 이유는 org buffer시작할때마다 위에설정 호출해서 그버퍼는 변수상태로 셋업하기 위함.
      :config
      (setq org-ellipsis " ▾" ; S-tab하면 ... 나오는걸 이걸로 바꾸기 위함
            org-hide-emphasis-markers t)) ;bold link등 */같은거 안보이게
      (setq org-agenda-start-with-log-mode t)
      (setq org-log-done 'time)
      (setq org-log-into-drawer t)
      (setq org-agenda-files ; agenda에서 관리할 파일 리스트로 ""다음줄에 ""또넣어도됨
            '("~/workspace/org/tasks.org"
              "~/workspace/org/test.org")) ; '요거 하나는 뒤에가 리스트라는 의미로 펑션콜이 아님을 의미

    ;todo의 종류들을 추가하는 것으로 |기준으로 active냐 종료상태를 좌우로 나뉨
    (setq org-todo-keywords
          '((sequenct "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVITE(a)" "REVIEW(v)" "WAIT(w@/!)" "|" "COMPLETED(c)" "CANC(k@)")))
    (setq org-refile-targets
          '((nil :maxlevel . 1)
           (org-agenda-files :maxlevel . 1)))

  ;(advice-add 'org-refile :after 'org-save-all-org-buffers)
  ;이렇게 하면 org-refile실행시 바로 org-save-all-org-buffers가 실행이됨
#+end_src

#+RESULTS:
: ((nil :maxlevel . 1) (org-agenda-files :maxlevel . 1))

*** Noweb

- 블럭의 결과를 다른 블럭에 쓰거나 할때 씀 json이나 txt파일들을 쓸때도 씀.
- :noweb yes하면 값을 가져올 수 있음

#+NAME: the-value
  #+begin_src emacs-lisp
;(+ 55 100)
  #+end_src

  #+RESULTS: the-value
  : 155


#+begin_src python :noweb yes :results output
	print(<<the-value()>>)
#+end_src

#+RESULTS:
: 155
